from flask import Flask

# ==================================================
# インスタンス生成
# ==================================================
app = Flask(__name__)

# ==================================================
# ルーティング：「/」にアクセスされたときの処理
# ==================================================
@app.route('/')
# ルーティングの条件で実行される関数
def hello_world():
    return '<h1>ハローフラスコ</h1>'

# ==================================================
# 実行ボタンを有効にする
# ==================================================
# Pythonで実行した時に動作
if __name__ == "__main__":
    # ホストとポートの指定
    # debugモードをTrueにすると保存時リロードされる
    app.run(host="0.0.0.0",port=5001,debug = True)
    # コマンドで実行の場合は
    # flask --app app run -h 0.0.0.0 -p 5001 --debugger --reload